export const questions = [
  {
    "question": "Что такое Arduino?",
    "answers": [
      "Платформа для создания электронных проектов",
      "Только программа для презентаций",
      "Система хранения файлов",
      "Графический редактор"
    ],
    "correct": 0
  },
  {
    "question": "Для чего используется GND?",
    "answers": [
      "Общий провод / земля",
      "Для передачи видео",
      "Для Wi‑Fi",
      "Для увеличения памяти"
    ],
    "correct": 0
  },
  {
    "question": "Когда выполняется setup()?",
    "answers": [
      "Один раз при запуске или сбросе",
      "Постоянно в цикле",
      "Только после нажатия кнопки",
      "Никогда автоматически"
    ],
    "correct": 0
  },
  {
    "question": "Что делает loop()?",
    "answers": [
      "Повторяет код во время работы платы",
      "Только компилирует код",
      "Перезагружает компьютер",
      "Меняет порт USB"
    ],
    "correct": 0
  },
  {
    "question": "Для чего нужна pinMode()?",
    "answers": [
      "Чтобы задать режим вывода INPUT или OUTPUT",
      "Чтобы открыть браузер",
      "Чтобы изменить пароль",
      "Чтобы сохранить файл"
    ],
    "correct": 0
  },
  {
    "question": "Что возвращает digitalRead()?",
    "answers": [
      "HIGH или LOW",
      "Только текст",
      "Файл изображения",
      "IP-адрес"
    ],
    "correct": 0
  },
  {
    "question": "Для чего используется analogRead()?",
    "answers": [
      "Для чтения аналогового значения",
      "Для управления GitHub",
      "Для установки Arduino IDE",
      "Для создания пользователя"
    ],
    "correct": 0
  },
  {
    "question": "Какой диапазон обычно используют в analogWrite() на Arduino Uno?",
    "answers": [
      "0–255",
      "0–10",
      "0–1",
      "0–10000"
    ],
    "correct": 0
  },
  {
    "question": "Для чего нужен Serial Monitor?",
    "answers": [
      "Для просмотра данных и отладки",
      "Для пайки",
      "Для подачи питания на двигатель",
      "Для изменения схемы автоматически"
    ],
    "correct": 0
  },
  {
    "question": "Что важно сделать перед изменением схемы?",
    "answers": [
      "Отключить питание",
      "Увеличить напряжение",
      "Замкнуть 5V и GND",
      "Удалить программу"
    ],
    "correct": 0
  },
  {
    "question": "Зачем светодиоду часто нужен резистор?",
    "answers": [
      "Чтобы ограничить ток",
      "Чтобы подключить Wi‑Fi",
      "Чтобы хранить код",
      "Чтобы изменить частоту USB"
    ],
    "correct": 0
  },
  {
    "question": "Что нужно для получения сертификата STEM Academia?",
    "answers": [
      "Завершить занятия и набрать не менее 80% на тесте",
      "Только открыть курс",
      "Только войти в аккаунт",
      "Создать новую школу"
    ],
    "correct": 0
  }
];
