export const questions = [
  {
    "question": "Для чего используется Labdisc?",
    "answers": [
      "Для сбора и анализа экспериментальных данных",
      "Только для печати документов",
      "Только для просмотра видео",
      "Для создания презентаций"
    ],
    "correct": 0
  },
  {
    "question": "Какая программа используется для работы с данными Labdisc?",
    "answers": [
      "GlobiLab X",
      "Paint",
      "PowerPoint",
      "Calculator"
    ],
    "correct": 0
  },
  {
    "question": "Какой способ подключения может использоваться с Labdisc?",
    "answers": [
      "USB",
      "Только HDMI",
      "Только VGA",
      "Только Ethernet"
    ],
    "correct": 0
  },
  {
    "question": "Что измеряет датчик температуры?",
    "answers": [
      "Температуру",
      "Освещённость",
      "Уровень звука",
      "Расстояние"
    ],
    "correct": 0
  },
  {
    "question": "Что нужно сделать перед началом эксперимента?",
    "answers": [
      "Проверить устройство, заряд и необходимые датчики",
      "Сразу выключить Labdisc",
      "Удалить все данные",
      "Отключить все датчики"
    ],
    "correct": 0
  },
  {
    "question": "Для чего используется график после эксперимента?",
    "answers": [
      "Для анализа изменения измеряемой величины",
      "Для украшения документа",
      "Для изменения пароля",
      "Для подключения USB"
    ],
    "correct": 0
  },
  {
    "question": "Что зависит от конкретной модели Labdisc?",
    "answers": [
      "Набор доступных датчиков",
      "Название платформы STEM Trainer",
      "Цвет сайта",
      "Логин преподавателя"
    ],
    "correct": 0
  },
  {
    "question": "Какая модель Labdisc ориентирована на экологические исследования?",
    "answers": [
      "Enviro",
      "Physio",
      "BioChem",
      "Arduino"
    ],
    "correct": 0
  },
  {
    "question": "Какая модель ориентирована на физические эксперименты?",
    "answers": [
      "Physio",
      "Enviro",
      "BioChem",
      "Gensci Printer"
    ],
    "correct": 0
  },
  {
    "question": "Что является последним этапом исследовательской работы?",
    "answers": [
      "Формулирование вывода",
      "Выбор цвета интерфейса",
      "Создание логина",
      "Удаление графика"
    ],
    "correct": 0
  }
];
