export const questions=[
  {
    "question": "Для чего нужен Raspberry Pi Imager?",
    "answers": [
      "Для записи Raspberry Pi OS на загрузочный носитель",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Какая ОС является официальной для Raspberry Pi?",
    "answers": [
      "Raspberry Pi OS",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Поддерживает ли Raspberry Pi 4 64-bit Raspberry Pi OS?",
    "answers": [
      "Да",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что происходит с данными выбранной microSD при записи нового образа?",
    "answers": [
      "Они удаляются/перезаписываются",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что выбирают в Imager перед записью?",
    "answers": [
      "Device, OS и Storage",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Где обычно находится загрузочная система Raspberry Pi 4?",
    "answers": [
      "На microSD или другом поддерживаемом загрузочном носителе",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что такое GPIO?",
    "answers": [
      "Контакты общего назначения для цифрового ввода/вывода и других интерфейсов",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Зачем проверять GPIO-схему до включения?",
    "answers": [
      "Чтобы снизить риск неправильного подключения",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что делает pwd в Terminal?",
    "answers": [
      "Показывает текущую папку",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что делает ls?",
    "answers": [
      "Показывает содержимое папки",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Для чего используется Python в курсе?",
    "answers": [
      "Для написания программ и управления учебным GPIO-проектом",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что является входом в мини-проекте?",
    "answers": [
      "Кнопка",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что является выходом в мини-проекте?",
    "answers": [
      "LED",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что делать при нагреве или необычном запахе в GPIO-схеме?",
    "answers": [
      "Отключить питание и сообщить преподавателю",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Когда подключают/перестраивают учебную GPIO-схему?",
    "answers": [
      "При выключенном устройстве/питании",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что проверяет итоговая практика?",
    "answers": [
      "Запуск ОС, работу с файлами, Terminal, Python и GPIO",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Какой тип Raspberry Pi OS удобен для этого учебного курса?",
    "answers": [
      "Версия с графическим Desktop",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Где брать актуальные образы и инструкции?",
    "answers": [
      "На официальном сайте и в документации Raspberry Pi",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  },
  {
    "question": "Что нужно сделать перед выбором Storage в Imager?",
    "answers": [
      "Убедиться, что выбрана именно нужная microSD",
      "Создать нового администратора",
      "Удалить GitHub-репозиторий",
      "Изменить пароль школы"
    ],
    "correct": 0
  }
];
